# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23]        # P3/8
  - [30, 61, 62, 45, 59, 119]       # P4/16
  - [116, 90, 156, 198, 373, 326]   # P5/32

# YOLOv5 v6.0 backbone (KITTI, Ghost-only variant)
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]],        # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],          # 1-P2/4
    [-1, 3, C3, [128]],                  # 2
    [-1, 1, Conv, [256, 3, 2]],          # 3-P3/8

    # [-1, 6, C3, [256]],                # 4 original
    [-1, 6, C3, [256]],                  # 4 (same as baseline, no CA)

    [-1, 1, Conv, [512, 3, 2]],          # 5-P4/16

    # [-1, 9, C3, [512]],                # 6 original
    [-1, 9, C3, [512]],                  # 6 (same as baseline, no CA)

    [-1, 1, Conv, [1024, 3, 2]],         # 7-P5/32
    [-1, 3, C3, [1024]],                 # 8
    [-1, 1, SPPF, [1024, 5]],            # 9
  ]

# YOLOv5 v6.0 head (Ghost neck only)
head:
  [
    [-1, 1, Conv, [512, 1, 1]],          # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 11
    [[-1, 6], 1, Concat, [1]],           # 12 cat backbone P4

    # [-1, 3, C3, [512, False]],         # 13 original
    [-1, 3, C3Ghost, [512, False]],      # 13 changed from: C3 -> C3Ghost

    [-1, 1, Conv, [256, 1, 1]],          # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],  # 15
    [[-1, 4], 1, Concat, [1]],           # 16 cat backbone P3

    # [-1, 3, C3, [256, False]],         # 17 original (P3/8-small)
    [-1, 3, C3Ghost, [256, False]],      # 17 changed from: C3 -> C3Ghost

    [-1, 1, Conv, [256, 3, 2]],          # 18
    [[-1, 14], 1, Concat, [1]],          # 19 cat head P4

    # [-1, 3, C3, [512, False]],         # 20 original (P4/16-medium)
    [-1, 3, C3Ghost, [512, False]],      # 20 changed from: C3 -> C3Ghost

    [-1, 1, Conv, [512, 3, 2]],          # 21
    [[-1, 10], 1, Concat, [1]],          # 22 cat head P5

    # [-1, 3, C3, [1024, False]],        # 23 original (P5/32-large)
    [-1, 3, C3Ghost, [1024, False]],     # 23 changed from: C3 -> C3Ghost

    [[17, 20, 23], 1, Detect, [nc, anchors]],  # 24 Detect(P3, P4, P5)
  ]
